<?php

return [
    'not_id'                            => 'Записи по данному идентификатору не найдено.',
    'not_unique'                        => 'В поле :field необходимо передать уникальное значение.',
    'permission_not_id'                 => 'Значение :id "permissions[]" некорректно.',
    'not_user'                          => 'Пользователя с такими учетными данными не существует.',
    'not_user_email'                    => 'Пользователя с таким Email не существует.',
    'email_not_verification'            => 'Email не верифицирован.',
    'password_matches_the_previous_one' => 'Пароль совпадает с предыдущим.',
    'error_code'                        => 'Проверочный kод не верен или устарел.',
    'code_does_not_match'               => 'Проверочный код не совпадает.',

    'password:0' => 'Поле «пароль» должен содержать не менее :min символов',
    'password:1' => 'Поле «пароль» должен содержать по крайней мере одну прописную и одну строчную букву',
    'password:2' => 'Поле «пароль» должно содержать хотя бы одну букву',
    'password:3' => 'Поле «пароль» должно содержать хотя бы одно число.',

    'the_record_is_used' => 'Запись используется',
];
